DataProcessors/ДокументооборотСКонтролирующимиОрганами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ДокументооборотСКонтролирующимиОрганами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЖурналНовыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналНовыхСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказатьПользователю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СеансСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СеансыСвязиСКонтролирующимиОрганами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСдачиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоПолучено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправляетсяВКонтролирующийОрган</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКритическиеОшибкиОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраницаЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтраницыЖурналаОтчетность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтролирующегоОргана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтролирующихОрганов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовВЖурнале</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметЦиклаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолученныеСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанныеЗапросы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенныеОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезавершенныеОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтролирующихОрганов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтролирующихОрганов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСРАР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьБанкРоссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роструд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минобороны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФАС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минюст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РЭЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияЮЛФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦПРР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роскомнадзор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минпромторг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументовВЖурнале.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДокументовВЖурнале</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТребованиеИлиУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтраницыЖурналаОтчетность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтраницыЖурналаОтчетность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕГРЮЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервисы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыИПособия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИнициаторыСеансовСвязиСКонтролирующимиОрганами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИнициаторыСеансовСвязиСКонтролирующимиОрганами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автообмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ДокументооборотСКонтролирующимиОрганами/Forms/ФормаНовыхСобытий/Ext/Form/Module.bsl
&НаКлиенте
Перем КонтекстЭДОКлиент;

&НаКлиенте
Перем ВыбранныеОрганизации; // для обмена.

&НаКлиенте
Перем НомерОбъекта; // для обмена.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРежимОблачной1СО = ДокументооборотСКОПовтИсп.ЭтоРежимОблачной1СО();
	НовыеСобытияПоСтраницамЖурнала =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.НовыеСобытияПоСтраницамЖурнала();
	ЭтоАвтообмен = НЕ ЭтоРежимОблачной1СО ИЛИ НЕ НовыеСобытияПоСтраницамЖурнала
		ИЛИ НЕ Параметры.Свойство("ПереданныйРежимОткрытияОкна")
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.ПереданныйРежимОткрытияОкна);
	
	ФонНевыделенного = ЦветаСтиля.БазовыйЦветФонаЭтапаОтправки;
	ЦветГиперссылки = ЦветаСтиля.ГиперссылкаЦвет;
	
	Параметры.Свойство("АдресСведенийПоОшибкам", АдресСведенийПоОшибкам);
	Если НЕ ЗначениеЗаполнено(АдресСведенийПоОшибкам) И НЕ ЭтоАвтообмен Тогда
		ОшибкиПоследнегоОбмена = ДлительнаяОтправкаВызовСервера.ПолучитьОшибкиПоследнегоОбмена();
		Если ОшибкиПоследнегоОбмена <> Неопределено Тогда
			АдресСведенийПоОшибкам = ПоместитьВоВременноеХранилище(ОшибкиПоследнегоОбмена, Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимостьПанелиОшибокОбновления(ЭтаФорма);
	
	ОткрыватьВЛюбомСлучае = Параметры.Свойство("АдресДереваНовых") И ЗначениеЗаполнено(Параметры.АдресДереваНовых);
	
	Если НовыеСобытияПоСтраницамЖурнала Тогда
		МассивИнформацииЭкранов = ПолучитьИнформациюЭкрановКлиента();
		Если МассивИнформацииЭкранов <> Неопределено И МассивИнформацииЭкранов.Количество() <> 0 Тогда
			ШиринаЭкрана = МассивИнформацииЭкранов[0].Ширина + 0;
		КонецЕсли;
	КонецЕсли;
	ОтборВидСообщения = Ложь;
	АдресДереваНовых = "";
	Параметры.Свойство("АдресДереваНовых", АдресДереваНовых);
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	Если НовыеСобытияПоСтраницамЖурнала Тогда
		Элементы.Новое.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		Если ШиринаЭкрана <> 0 И ШиринаЭкрана <= 1440 ИЛИ ЭтоАвтообмен Тогда
			Элементы.ГруппаОтборОрганизацияНовое.Ширина = ?(ШиринаЭкрана <> 0 И ШиринаЭкрана <= 1280, 27, 28);
			Элементы.ГруппаОтборГосорганНовое.Ширина = ?(ШиринаЭкрана <> 0 И ШиринаЭкрана <= 1280, 27, 28);
			Элементы.ГруппаОтборПериодНовое.Ширина = ?(ШиринаЭкрана <> 0 И ШиринаЭкрана <= 1280, 27, 28);
			Элементы.БлокиНовогоВсе.Ширина = 0;
			Элементы.БлокиНовогоТребования.Ширина = 0;
			Элементы.БлокиНовогоОтчеты.Ширина = 0;
			Элементы.БлокиНовогоУведомления.Ширина = 0;
			Элементы.БлокиНовогоСверки.Ширина = 0;
			Элементы.БлокиНовогоПисьма.Ширина = 0;
			Элементы.БлокиНовогоВходящие.Ширина = 0;
			Элементы.БлокиНовогоВыплатыИПособия.Ширина = 0;
		КонецЕсли;
	КонецЕсли;
	Элементы.ГруппаОтборовНовое.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.ГруппаНовоеОбмен.Видимость = ЭтоРежимОблачной1СО;
	Элементы.ОткрытьВПолномРазмере.Видимость = ЭтоАвтообмен;
	Элементы.ОшибкиОбновленияСлева.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.ОшибкиОбновленияСправа.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.ОшибкиОбновленияСверху.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.ОшибкиОбновленияСнизу.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.БлокиНовогоОбщая.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.НовоеСлева.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.НовоеСправа.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.НовоеСверху.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.НовоеСнизу.Видимость = НовыеСобытияПоСтраницамЖурнала;
	ПоказыватьНеобходимоРасшифровать = НовыеСобытияПоСтраницамЖурнала И НЕ ЭтоАвтообмен
		И ?(Параметры.Свойство("ПереданныйРежимОткрытияОкна"), Параметры.ПереданныйРежимОткрытияОкна,
			РежимОткрытияОкнаФормы.Независимый) = РежимОткрытияОкнаФормы.Независимый;
	ЗаполнитьНеобходимоРасшифровать();
	Если ЭтоРежимОблачной1СО И НовыеСобытияПоСтраницамЖурнала Тогда
		МассивПодключенныхОрганизаций = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ПодключенныеОрганизации();
		ПодключенныеОрганизации.ЗагрузитьЗначения(МассивПодключенныхОрганизаций);
	КонецЕсли;
	
	Если ЭтоАвтообмен Тогда
		Заголовок = СтрШаблон(
			НСтр("ru = 'Обмен с контролирующими органами %1'"),
			Формат(ДатаПоследнегоОбновления, "ДФ='дд.ММ.гггг Ч:мм'"));
		
	Иначе
		Заголовок = НСтр("ru = 'Новые сообщения'");
	КонецЕсли;
	
	Если ЭтоАвтообмен И КоличествоНовых = 0 И НЕ ОткрыватьВЛюбомСлучае Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Попытка
		МодульСверкаСФНС = ОбщегоНазначения.ОбщийМодуль("СверкаСФНС");
	Исключение
	    МодульСверкаСФНС = Неопределено;
	КонецПопытки;
	
	Если МодульСверкаСФНС <> Неопределено Тогда
		МодульСверкаСФНС.ФормаНовыхСобытий_ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Завершение обновления"
		ИЛИ ИмяСобытия = "Завершение расшифровки"
		ИЛИ ИмяСобытия = "Завершение групповой отправки"
		ИЛИ ИмяСобытия = "Закрытие формы ошибок отправки 1С-Отчетности" Тогда
		
		ЗаполнитьНеобходимоРасшифроватьВФоне();
		
	ИначеЕсли ИмяСобытия = "Пометка прочтенным"
		ИЛИ ИмяСобытия = "Пометка непрочтенным"
		ИЛИ ИмяСобытия = "Скрытие/восстановление объекта"
		ИЛИ ИмяСобытия = "Групповая пометка прочтенными/непрочтенными" Тогда
		
		Если ЭтоРежимОблачной1СО Тогда
			МодульКалендарьОтчетностиВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("КалендарьОтчетностиВызовСервера");
			Если ИмяСобытия = "Групповая пометка прочтенными/непрочтенными" Тогда
				Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("СтавшиеНепрочтенными") Тогда
					Для каждого СсылкаВКлюче Из Параметр.СтавшиеНепрочтенными Цикл
						МодульКалендарьОтчетностиВызовСервера.СнятьУстановитьПометкуНовогоДляДокументаСЭДО(СсылкаВКлюче,
							"Пометка непрочтенным");
					КонецЦикла;
				КонецЕсли;
				
				Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("СтавшиеПрочтенными") Тогда
					Для каждого СсылкаВКлюче Из Параметр.СтавшиеПрочтенными Цикл
						МодульКалендарьОтчетностиВызовСервера.СнятьУстановитьПометкуНовогоДляДокументаСЭДО(СсылкаВКлюче,
							"Пометка прочтенным");
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				СсылкаВКлюче = Неопределено;
				Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Организация") И Параметр.Свойство("Ссылка") Тогда
					СсылкаВКлюче = Параметр.Ссылка;
				ИначеЕсли Параметр = Неопределено Тогда
					СсылкаВКлюче = Источник;
				ИначеЕсли Источник <> Неопределено И ОбщегоНазначенияЭДКОКлиент.ЭтоЗначениеТипаСОтображениемНаСервере(Источник) Тогда
					СсылкаВКлюче = Источник;
				КонецЕсли;
				
				МодульКалендарьОтчетностиВызовСервера.СнятьУстановитьПометкуНовогоДляДокументаСЭДО(СсылкаВКлюче, ИмяСобытия);
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяСобытия = "Пометка непрочтенным" ИЛИ ИмяСобытия = "Скрытие/восстановление объекта"
			ИЛИ ИмяСобытия = "Групповая пометка прочтенными/непрочтенными"
				И ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("СтавшиеНепрочтенными")
				И Параметр.СтавшиеНепрочтенными.Количество() <> 0 Тогда
			
			ЗаполнитьДеревоНовое();
			ОбновитьКнопкуНовыеСообщения();
			ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
			
		Иначе
			МассивГрупп = Новый Массив;
			СтрокиДерева = Новое.ПолучитьЭлементы();
			Если НовыеСобытияПоСтраницамЖурнала И ОтборГруппа = Неопределено Тогда
				СтрокиДерева = ОбщегоНазначенияЭДКОКлиентСервер.СтрокиДереваСПодчиненными(СтрокиДерева);
			КонецЕсли;
			Для Каждого СтрокаДерева Из СтрокиДерева Цикл
				Если СтрокаДерева.ИсходнаяГруппа = ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.НезавершенныеОтправки") Тогда
					Прервать;
				КонецЕсли;
				
				Если СтрокаДерева.Ссылка = Источник
					ИЛИ ИмяСобытия = "Групповая пометка прочтенными/непрочтенными"
						И ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("СтавшиеПрочтенными")
						И Параметр.СтавшиеПрочтенными.Найти(СтрокаДерева.Ссылка) <> Неопределено Тогда
					
					СтрокаДерева.НеПрочитано = Ложь;
					Если МассивГрупп.Найти(СтрокаДерева.Группа) = Неопределено Тогда
						МассивГрупп.Добавить(СтрокаДерева.Группа);
					КонецЕсли;
					Если ИмяСобытия <> "Групповая пометка прочтенными/непрочтенными" Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Для каждого ГруппаОбновленияКоличества Из МассивГрупп Цикл
				ОбновитьКоличествоНовых(ЭтотОбъект,, ГруппаОбновленияКоличества);
			КонецЦикла;
			ОбновитьКнопкуНовыеСообщения();
		КонецЕсли;
		
	ИначеЕсли (ИмяСобытия = "Получены новые сообщения 1С-Отчетности"
		ИЛИ ИмяСобытия = "Получены новые сообщения 1С-Отчетности без смены страницы") И Источник <> ЭтотОбъект Тогда
		
		Оповестить("Закрыть форму новых сообщений 1С-Отчетности",, ЭтотОбъект);
		
		ОтборГруппа = Неопределено;
		ОтборОрганизацияНовое = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		ОтборГосорганНовое = ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ПустаяСсылка");
		ОтборПериодНовое = Новый СтандартныйПериод();
		НачалоПериодаНовое = Дата(1, 1, 1);
		КонецПериодаНовое = Дата(1, 1, 1);
		ТолькоУказанныйПериодНовое = Ложь;
		ОтборВидСообщения = Ложь;
		
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("АдресСведенийПоОшибкам")
			ИЛИ ЭтоАдресВременногоХранилища(Параметр) Тогда
			
			Если ТипЗнч(Параметр) = Тип("Структура") Тогда
				АдресСведенийПоОшибкам = Параметр.АдресСведенийПоОшибкам;
			ИначеЕсли ЭтоАдресВременногоХранилища(Параметр) Тогда
				АдресСведенийПоОшибкам = Параметр;
			КонецЕсли;
			УстановитьВидимостьПанелиОшибокОбновления(ЭтаФорма);
		КонецЕсли;
		
		ЗаполнитьДеревоНовое();
		ОбновитьКнопкуНовыеСообщения();
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
		ЗаполнитьНеобходимоРасшифроватьВФоне();
		
		Активизировать();
		
	ИначеЕсли ИмяСобытия = "Завершение автообмена с сервером ФСС" ИЛИ ИмяСобытия = "Завершение автообмена с сервером ФСРАР"
		ИЛИ ИмяСобытия = "Завершение автообмена с сервером РПН" ИЛИ ИмяСобытия = "Завершение автообмена с сервером ФТС"
		Или ИмяСобытия = РегламентированнаяОтчетностьКлиент.ИмяСобытияЗавершениеОтправкиВКонтролирующийОрган()
		ИЛИ ИмяСобытия = РегламентированнаяОтчетностьКлиент.ИмяСобытияЗавершениеОтправки()  Тогда
		
		ЗаполнитьДеревоНовое();
		ОбновитьКнопкуНовыеСообщения();
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
	ИначеЕсли ИмяСобытия = "Закрыть форму новых сообщений 1С-Отчетности" И Источник <> ЭтаФорма
		И ЭтоАвтообмен Тогда
		
		ОтключитьОбработчикОжидания("ИнициализацияКонтекстЭДО");
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьНеобходимоРасшифровать" Тогда
		Если Параметр.Статус <> Неопределено И Параметр.Статус = "Выполнено" Тогда
			НеобходимоРасшифровать = ПолучитьИзВременногоХранилища(Параметр.АдресРезультата);
			ЗаполнитьНеобходимоРасшифровать(НеобходимоРасшифровать);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаУведомленияПолученияСообщения(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗаполнитьНеобходимоРасшифроватьВФоне();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Оповещение в форму 1С-Отчетности для того, чтобы вместо формы новых открыть закладку Новые.
	Оповестить("Получены новые сообщения 1С-Отчетности", АдресСведенийПоОшибкам, ЭтаФорма);
	
	ИщемФорму = ?(ЭтоРежимОблачной1СО
		И ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.Облачная1СОИспользоватьФормуНовыхСобытий(),
		"Форма.ФормаНовыхСобытий", "ОбщаяФорма.РегламентированнаяОтчетность");
	Если ЭтоАвтообмен
		И ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ФормаОткрыта(ИщемФорму) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
		Если НовыеСобытияПоСтраницамЖурнала Тогда
			СистемнаяИнформация = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаУведомленияПолученияСообщения", ЭтотОбъект);
				Выполнить("УведомленияКлиента.ПодключитьОбработчик(""ДокументооборотСКО_ПолученыСообщения"", ОписаниеОповещения)");
				Выполнить("УведомленияКлиента.ПодключитьОбработчик(""ЭлектронныйДокументооборотСФСС_ПолученыСообщенияСЭДО"", ОписаниеОповещения)");
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
	Если НовыеСобытияПоСтраницамЖурнала Тогда
		// переход на первый элемент с данными и раскрыть его
		ПерейтиНаБлокНовогоИРаскрыть();
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИнициализацияКонтекстЭДОЗавершение", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияКонтекстЭДОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	ТекстОшибкиИнициализацииКонтекстаЭДО = Результат.ТекстОшибки;
	
	Если НЕ НовыеСобытияПоСтраницамЖурнала ИЛИ ЭтоАвтообмен Тогда
		ОтметитьДеревоПросмотренным();
	КонецЕсли;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ФормаНовыхСобытий_ПослеОткрытия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	#Если НЕ ВебКлиент Тогда
		Если НовыеСобытияПоСтраницамЖурнала Тогда
			СистемнаяИнформация = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
				Выполнить("УведомленияКлиента.ОтключитьОбработчик(""ДокументооборотСКО_ПолученыСообщения"")");
				Выполнить("УведомленияКлиента.ОтключитьОбработчик(""ЭлектронныйДокументооборотСФСС_ПолученыСообщенияСЭДО"")");
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СообщениеПроОшибкиОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВходящийКонтекст = ПолучитьИзВременногоХранилища(АдресСведенийПоОшибкам);
	
	ДлительнаяОтправкаКлиент.ПоказатьОшибки(КонтекстЭДОКлиент.ПутьКОбъекту, ВходящийКонтекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияНовоеПриИзменении(Элемент)
	
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГосорганНовоеПриИзменении(Элемент)
	
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНовоеПриИзменении(Элемент)
	
	НачалоПериодаНовое = ОтборПериодНовое.ДатаНачала;
	КонецПериодаНовое = ОтборПериодНовое.ДатаОкончания;
	ТолькоУказанныйПериодНовое = Ложь;
	
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНовоеОчистка(Элемент, СтандартнаяОбработка)
	
	НачалоПериодаНовое = Дата(1, 1, 1);
	КонецПериодаНовое = Дата(1, 1, 1);
	ТолькоУказанныйПериодНовое = Ложь;
	
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоВсеЗаголовок(Команда)
	
	ОтборГруппа = Неопределено;
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоТребованияЗаголовок(Элемент)
	
	ОтборГруппа = ПредопределенноеЗначение("Перечисление.ВидыДокументовВЖурнале.ТребованиеИлиУведомление");
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоОтчетыЗаголовок(Элемент)
	
	ОтборГруппа = ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Отчеты");
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоУведомленияЗаголовок(Элемент)
	
	ОтборГруппа = ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Уведомления");
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоСверкиЗаголовок(Элемент)
	
	ОтборГруппа = ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Сверки");
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоПисьмаЗаголовок(Элемент)
	
	ОтборГруппа = ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Письма");
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоВходящиеЗаголовок(Элемент)
	
	ОтборГруппа = ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Входящие");
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоВыплатыИПособияЗаголовок(Элемент)
	
	ОтборГруппа = ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.ВыплатыИПособия");
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыНовое

&НаКлиенте
Процедура ТаблицаНовоеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Ссылка = Элемент.ТекущиеДанные.Ссылка;
	Если Поле.Имя = "ТаблицаНовоеОбъектНаименованиеСсылка" Тогда
		Если Элемент.ТекущиеДанные.ЕстьОтвет
			И ТипЗнч(Ссылка) <> Тип("СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов") Тогда // есть ответ
			Если КонтекстЭДОКлиент <> Неопределено И НЕ ПереопределитьОткрытие(Элемент) Тогда
				Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика") Тогда
					КонтекстЭДОКлиент.ПоказатьОтветНаЗапросИОН(Ссылка);
				ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗапросНаИнформационноеОбслуживаниеСтрахователя") Тогда
					КонтекстЭДОКлиент.ПоказатьОтветНаЗапросИОС(Ссылка);
				ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП") Тогда
					КонтекстЭДОКлиент.ПоказатьОтветНаЗапросВыпискиЕГРЮЛ_ЕГРИП(Ссылка);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НЕ ПереопределитьОткрытие(Элемент) Тогда
			РедактироватьОбъект(Элемент);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "ТаблицаНовоеСтатус" Тогда
		ПоказатьФормуСтатусовОтправкиИзСписка(Элемент);
	ИначеЕсли Поле.Имя = "ТаблицаНовоеЕстьКритическиеОшибкиОтправки" И Элемент.ТекущиеДанные.ЕстьКритическиеОшибкиОтправки Тогда
		ПоказатьКритическиеОшибкиПоСсылке(Ссылка);
	ИначеЕсли НЕ ПереопределитьОткрытие(Элемент) Тогда
		РедактироватьОбъект(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеПередРазворачиванием(Элемент, Строка, Отказ)
	
	ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если ЗначениеЗаполнено(ДатаРазворачиванияВМиллисекундах)
		И ДатаВМиллисекундах - ДатаРазворачиванияВМиллисекундах < 1500 Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_НовоеРазворачивание", 0.5, Истина);
	ДатаРазворачиванияВМиллисекундах = ДатаВМиллисекундах;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НеобходимоРасшифроватьРасшифровать(Команда)
	
	КонтекстЭДОКлиент.ПолучитьИОбработатьВходящиеКлиент(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВПолномРазмере(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Раздел", "new-button");
	ПараметрыФормы.Вставить("Форма", Неопределено);
	ПараметрыФормы.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.Независимый);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьРазделОтчетности(ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ДанныеДляОбмена = ВсеОрганизации();
	ВыбранныеОрганизации = ДанныеДляОбмена.МассивОрганизаций;
	
	КалендарьОтчетностиБРОКлиентПереопределяемый.ПолучитьОтборПоОрганизациям(ВыбранныеОрганизации);
	
	Если ДанныеДляОбмена.МассивОрганизаций.Количество() = 0
		И НЕ ДанныеДляОбмена.ЕстьОграничения Тогда
		ДлительнаяОтправкаКлиентСервер.ВывестиОшибку(НСтр("ru = 'Организация не выбрана'"), ,"Организация");
		Возврат;
	КонецЕсли;
	
	СостояниеВозможностиОбмена = КонтекстЭДОКлиент.СостояниеВозможностиОбмена(ДанныеДляОбмена.МассивОрганизаций);
	
	Если СостояниеВозможностиОбмена.Состояние = 1 Тогда
		ОбновитьДанныеПродолжить(ДанныеДляОбмена.МассивОрганизаций);
	ИначеЕсли СостояниеВозможностиОбмена.Состояние <> 2 Тогда
		ПараметрыЦикла = Новый Структура;
		ПараметрыЦикла.Вставить("ВыбранныеОрганизации", ДанныеДляОбмена.МассивОрганизаций);
		СледующееОповещение = Новый ОписаниеОповещения("НастроитьОграниченияОбмена", ЭтотОбъект, ПараметрыЦикла);
		ОткрытьФормуНастройкиОбновления(Истина, СледующееОповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбновленияКоманднаяПанель(Команда)
	
	КалендарьОтчетностиБРОКлиентПереопределяемый.ОбработкаКоманды(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	ВсеГруппы = Истина;
	РазвернутьГруппы = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект, ВсеГруппы,
		РазвернутьГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	ВсеГруппы = Истина;
	РазвернутьГруппы = Истина;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект, ВсеГруппы,
		РазвернутьГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыеСообщения(Команда)
	
	ОтборВидСообщения = Ложь;
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеСообщения(Команда)
	
	ОтборВидСообщения = Истина;
	АдресДереваНовых = "";
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДеревоНовое();
	ОбновитьКнопкуНовыеСообщения();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьПрочитанным(Команда)
	
	Результат = ПометитьПрочтенными();
	
	Если Результат.СтавшиеПрочтенными.Количество() + Результат.СтавшиеНепрочтенными.Количество() = 1 Тогда
		Если Результат.СтавшиеПрочтенными.Количество() = 1 Тогда
			Оповестить("Пометка прочтенным",, Результат.СтавшиеПрочтенными[0]);
		ИначеЕсли Результат.СтавшиеНепрочтенными.Количество() = 1 Тогда
			Оповестить("Пометка непрочтенным",, Результат.СтавшиеНепрочтенными[0]);
		КонецЕсли;
		
	Иначе
		Если Результат.СтавшиеПрочтенными.Количество() <> 0 Тогда
			ИсточникСобытия = Результат.СтавшиеПрочтенными[0];
		ИначеЕсли Результат.СтавшиеНепрочтенными.Количество() <> 0 Тогда
			ИсточникСобытия = Результат.СтавшиеНепрочтенными[0];
		Иначе
			ИсточникСобытия = Неопределено;
		КонецЕсли;
		
		Оповестить("Групповая пометка прочтенными/непрочтенными", Результат, ИсточникСобытия);
	КонецЕсли;
	
	// Обновление динамического списка.
	Элементы.Новое.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Если Форма.ЭтоАвтообмен И НЕ ЗначениеЗаполнено(Форма.АдресДереваНовых) И Форма.ОткрыватьВЛюбомСлучае Тогда
		Форма.Заголовок = НСтр("ru = 'Новые сообщения'");
	КонецЕсли;
	
	Форма.Элементы.ГруппаОтборВидСообщения.Заголовок = ?(Форма.ОтборВидСообщения,
		НСтр("ru = 'Все сообщения'"), НСтр("ru = 'Новые сообщения'"));
	Если Форма.ОтборВидСообщения Тогда
		Форма.Элементы.НовыеСообщения.Пометка = Ложь;
		Форма.Элементы.ВсеСообщения.Пометка = Истина;
	Иначе
		Форма.Элементы.ВсеСообщения.Пометка = Ложь;
		Форма.Элементы.НовыеСообщения.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПродолжить(ВыбранныеОрганизации)
	
	НомерОбъекта = 0;
	АдресСведенийПоОшибкам = "";
	УстановитьВидимостьПанелиОшибокОбновления(ЭтотОбъект);
	
	ИнтерфейсыВзаимодействияБРОКлиент.ОтложитьАвтообмен();
	ДокументооборотСКОКлиент.ЗапоминаниеОшибок("Сброс");
	ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
		НСтр("ru = 'Электронный документооборот с контролирующими органами. Обмен'"),,
		НСтр("ru = 'Запуск обновления'"));
	
	ПараметрыДлительногоОбмена = ДлительнаяОтправкаКлиент.ПараметрыДлительногоОбмена();
	ПараметрыДлительногоОбмена.Организации = ВыбранныеОрганизации;
	ПараметрыДлительногоОбмена.ЭтоОбменИзФормы1СОтчетность = Истина;
	
	Если НЕ ДлительнаяОтправкаКлиент.ПоказатьФормуДлительногоОбмена(ПараметрыДлительногоОбмена) Тогда // Обмен из 1С-Отчетность.
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОсуществитьОбменПоВыбраннымОрганизациям", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОсуществитьОбменПоВыбраннымОрганизациям()

	Если НомерОбъекта + 1 > ВыбранныеОрганизации.Количество() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОсуществитьОбменПоВыбраннымОрганизациямПослеНастройкиМЧДФНС",
			ЭтотОбъект);
		ДокументооборотСКОКлиент.НастроитьМЧДФНС(ОписаниеОповещения,, ВыбранныеОрганизации);
		
	Иначе
		
		// Получим очередную организацию для обмена
		ОрганизацияДляОбмена = ВыбранныеОрганизации[НомерОбъекта];
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОсуществитьОбменПоВыбраннымОрганизациямЗавершение",
			ЭтотОбъект);
		
		КонтекстЭДОКлиент.ОсуществитьОбменПоОрганизации(
			ЭтотОбъект,
			ОрганизацияДляОбмена,
			ОписаниеОповещения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсуществитьОбменПоВыбраннымОрганизациямПослеНастройкиМЧДФНС(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОтправкаКлиент.ОповеститьОЗавершенииОбмена(); // из формы 1С-Отчетность
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьНадписьВремяОбновления", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьНадписьВремяОбновления()
	
	НадписьВремяОбновления = ОбновитьНадписьВремяОбновления(ДатаПоследнегоОбновления);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьНадписьВремяОбновления(ДатаПоследнегоОбновления)
	
	ДатаПоследнегоОбновления = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ДатаПоследнегоОбновленияСобытий();
	Возврат ЭлектронныйДокументооборотСКонтролирующимиОрганами.ПолучитьНадписьВремяОбновления(ДатаПоследнегоОбновления);
	
КонецФункции

&НаКлиенте
Процедура ОсуществитьОбменПоВыбраннымОрганизациямЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НомерОбъекта = НомерОбъекта + 1;
	ПодключитьОбработчикОжидания("Подключаемый_ОсуществитьОбменПоВыбраннымОрганизациям", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПометитьПрочтенными(ВыделенныеСтроки = Неопределено)
	
	ВсеВыделенныеОбъекты = Новый Массив;
	СтавшиеПрочтенными = Новый Массив;
	СтавшиеНепрочтенными = Новый Массив;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		Для каждого Строка Из Элементы.Новое.ВыделенныеСтроки Цикл
			СвойстваСтроки = Новое.НайтиПоИдентификатору(Строка);
			ВсеВыделенныеОбъекты.Добавить(СвойстваСтроки.Ссылка);
		КонецЦикла;
	Иначе
		Для каждого Строка Из ВыделенныеСтроки Цикл
			ВсеВыделенныеОбъекты.Добавить(Строка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЖурналНовыхСобытий.Ссылка,
		|	НЕ ЖурналНовыхСобытий.Просмотрено КАК Непрочтенное
		|ИЗ
		|	РегистрСведений.ЖурналНовыхСобытий КАК ЖурналНовыхСобытий
		|ГДЕ
		|	ЖурналНовыхСобытий.Ссылка В(&Ссылки)");
	Запрос.УстановитьПараметр("Ссылки", ВсеВыделенныеОбъекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Непрочтенное Тогда
			СтавшиеПрочтенными.Добавить(Выборка.Ссылка);
			ЭлектронныйДокументооборотСКонтролирующимиОрганами.УстановитьНепрочтенность(
				Выборка.Ссылка,
				Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ВсеВыделенныеОбъекты", ВсеВыделенныеОбъекты);
	Результат.Вставить("СтавшиеПрочтенными", СтавшиеПрочтенными);
	Результат.Вставить("СтавшиеНепрочтенными", СтавшиеНепрочтенными);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПанелиОшибокОбновления(Форма)
	
	Форма.Элементы.ОшибкиОбновления.Видимость = ЭтоАдресВременногоХранилища(Форма.АдресСведенийПоОшибкам);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиОбновления(АвтоматическийВызов, СледующееОповещение = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АвтоматическийВызов", АвтоматическийВызов);
	ОткрытьФорму(КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.НастройкаОграниченийОбмена", ПараметрыФормы, , , , , СледующееОповещение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВсеОрганизации()
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОграничения", Ложь);
	
	КонтекстСервера = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Если КонтекстСервера <> Неопределено Тогда
		МассивОрганизаций = КонтекстСервера.ВыбранныеОрганизацииДляОбмена();
		Результат.Вставить("ЕстьОграничения", Истина);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Организации.Ссылка КАК Организация
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ПометкаУдаления = ЛОЖЬ";
	
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаОрганизаций = РезультатЗапроса.Выгрузить();
		
		МассивОрганизаций = ТаблицаОрганизаций.ВыгрузитьКолонку("Организация");
	КонецЕсли;
	
	Результат.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОтметитьДеревоПросмотренным()
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьДеревоПросмотренным(Новое);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОбъект(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Ссылка = ТекущиеДанные.Ссылка;
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ПоказатьЗначение(,Ссылка);
			Оповестить("Пометка прочтенным", , Ссылка);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКритическиеОшибкиПоСсылке(Ссылка)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.ПоказатьКритическиеОшибкиПоСсылке(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуСтатусовОтправкиИзСписка(Элемент)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
	КонецЕсли;
	
	КонтекстЭДОКлиент.ПоказатьФормуСтатусовОтправкиИзСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаБлокНовогоИРаскрыть(Группа = Неопределено)
	
	СтрокиДерева = Новое.ПолучитьЭлементы();
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ЭтоЗаголовокБлока И (Группа = Неопределено ИЛИ СтрокаДерева.Группа = Группа) Тогда
			ВложенныеСтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
			НашлиСтроку = Ложь;
			Для каждого ВложеннаяСтрокаДерева Из ВложенныеСтрокиДерева Цикл
				Если НЕ ВложеннаяСтрокаДерева.ЭтоЗаголовокБлока И (ЗначениеЗаполнено(ВложеннаяСтрокаДерева.Ссылка)
					ИЛИ ЗначениеЗаполнено(ВложеннаяСтрокаДерева.КонтролирующийОрган)) Тогда
					
					Элементы.Новое.ТекущаяСтрока = ВложеннаяСтрокаДерева.ПолучитьИдентификатор();
					НашлиСтроку = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НашлиСтроку Тогда
				Прервать;
			КонецЕсли;
			
		ИначеЕсли Группа = Неопределено И
			(ЗначениеЗаполнено(СтрокаДерева.Ссылка) ИЛИ ЗначениеЗаполнено(СтрокаДерева.КонтролирующийОрган)) Тогда
			
			Элементы.Новое.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопкуНовыеСообщения()
	
	Если ЭтоРежимОблачной1СО Тогда
		ОткрытыеОкна = ПолучитьОкна();
		Если ОткрытыеОкна <> Неопределено Тогда
			Для каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
				Для каждого ФормаОкна Из ОткрытоеОкно.Содержимое Цикл
					Если ТипЗнч(ФормаОкна) = Тип("ФормаКлиентскогоПриложения")
						И ФормаОкна.ИмяФормы = "ОбщаяФорма.РегламентированнаяОтчетность" Тогда
						
						ЭлементНовыеСообщения = ФормаОкна.Элементы.Найти("КалендарьОтчетностиНовыеСообщения");
						Если ЭлементНовыеСообщения <> Неопределено Тогда
							ЭлементНовыеСообщения.Картинка = ?(КоличествоНепрочитанных = 0,
								БиблиотекаКартинок.КолоколБезСообшений, БиблиотекаКартинок.КолоколЕстьСообщения);
						КонецЕсли;
						
						Возврат;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКоличествоНовых(Форма, УчитыватьОтборГруппа = Ложь, ГруппаОбновленияКоличества = Неопределено)
	
	// обновление в форме согласно отборам
	СведенияОКоличестве = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ОбновитьКоличествоНовых(
		Форма,,
		Форма.НовыеСобытияПоСтраницамЖурнала,
		Истина);
	
	// обновление панели со статистикой в заголовке таблицы
	Если Форма.НовыеСобытияПоСтраницамЖурнала Тогда
		ЦветТекстаВыделенногоБлока = Новый Цвет(43, 52, 63);
		ЦветФонаВыделенногоБлока = Новый Цвет(176, 214, 255);
		
		ВключатьПросмотренные = (Форма.ОтборВидСообщения = Истина);
		
		СвойстваКоличестваВБлоках = Новый Соответствие;
		СвойстваКоличестваВБлоках["Все"] = Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоВсеЗаголовок,
				Форма.Элементы.БлокиНовогоВсеОсновная,
				Форма.Элементы.БлокиНовогоВсеСверху,
				Форма.Элементы.БлокиНовогоВсеСнизу,
				НСтр("ru = 'Все (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхВсе,
				СведенияОКоличестве.КоличествоВсе);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.ВидыДокументовВЖурнале.ТребованиеИлиУведомление")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоТребованияЗаголовок,
				Форма.Элементы.БлокиНовогоТребованияОсновная,
				Форма.Элементы.БлокиНовогоТребованияСверху,
				Форма.Элементы.БлокиНовогоТребованияСнизу,
				НСтр("ru = 'Требования (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхТребования,
				СведенияОКоличестве.КоличествоТребования);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Отчеты")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоОтчетыЗаголовок,
				Форма.Элементы.БлокиНовогоОтчетыОсновная,
				Форма.Элементы.БлокиНовогоОтчетыСверху,
				Форма.Элементы.БлокиНовогоОтчетыСнизу,
				НСтр("ru = 'Отчеты (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхОтчеты,
				СведенияОКоличестве.КоличествоОтчеты);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Уведомления")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоУведомленияЗаголовок,
				Форма.Элементы.БлокиНовогоУведомленияОсновная,
				Форма.Элементы.БлокиНовогоУведомленияСверху,
				Форма.Элементы.БлокиНовогоУведомленияСнизу,
				НСтр("ru = 'Уведомления (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхУведомления,
				СведенияОКоличестве.КоличествоУведомления);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Сверки")] =
			Новый Структура("ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоСверкиЗаголовок,
				Форма.Элементы.БлокиНовогоСверкиОсновная,
				Форма.Элементы.БлокиНовогоСверкиСверху,
				Форма.Элементы.БлокиНовогоСверкиСнизу,
				НСтр("ru = 'Сверки (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхСверки,
				СведенияОКоличестве.КоличествоСверки);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Письма")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоПисьмаЗаголовок,
				Форма.Элементы.БлокиНовогоПисьмаОсновная,
				Форма.Элементы.БлокиНовогоПисьмаСверху,
				Форма.Элементы.БлокиНовогоПисьмаСнизу,
				НСтр("ru = 'Письма (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхПисьма,
				СведенияОКоличестве.КоличествоПисьма);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Входящие")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоВходящиеЗаголовок,
				Форма.Элементы.БлокиНовогоВходящиеОсновная,
				Форма.Элементы.БлокиНовогоВходящиеСверху,
				Форма.Элементы.БлокиНовогоВходящиеСнизу,
				НСтр("ru = 'Входящие (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхВходящие,
				СведенияОКоличестве.КоличествоВходящие);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.ВыплатыИПособия")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Форма.Элементы.БлокиНовогоВыплатыИПособияЗаголовок,
				Форма.Элементы.БлокиНовогоВыплатыИПособияОсновная,
				Форма.Элементы.БлокиНовогоВыплатыИПособияСверху,
				Форма.Элементы.БлокиНовогоВыплатыИПособияСнизу,
				НСтр("ru = 'Выплаты и пособия (%1)'"),
				СведенияОКоличестве.КоличествоНепрочитанныхВыплатыИПособия,
				СведенияОКоличестве.КоличествоВыплатыИПособия);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.ВидыДокументовВЖурнале.Рассылка")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Неопределено,
				Неопределено,
				Неопределено,
				Неопределено,
				"",
				СведенияОКоличестве.КоличествоНепрочитанныхРассылки,
				СведенияОКоличестве.КоличествоРассылки);
		СвойстваКоличестваВБлоках["Прочтенные"] = Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Неопределено,
				Неопределено,
				Неопределено,
				Неопределено,
				"",
				СведенияОКоличестве.КоличествоПрочтенные,
				СведенияОКоличестве.КоличествоПрочтенные);
		СвойстваКоличестваВБлоках[
			ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.ОбработанныеЗапросы")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Неопределено,
				Неопределено,
				Неопределено,
				Неопределено,
				"",
				СведенияОКоличестве.КоличествоОбработанныеЗапросы,
				СведенияОКоличестве.КоличествоОбработанныеЗапросы);
		СвойстваКоличестваВБлоках[
			ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.ЗавершенныеОтправки")] =
			Новый Структура(
				"ЭлементБлока, ГруппаБлока, ЭлементСверху, ЭлементСнизу, ТекстБлока, КоличествоВБлоке, ВсехВБлоке",
				Неопределено,
				Неопределено,
				Неопределено,
				Неопределено,
				"",
				СведенияОКоличестве.КоличествоЗавершенныеОтправки,
				СведенияОКоличестве.КоличествоЗавершенныеОтправки);
		
		СтрокиДерева = Форма.Новое.ПолучитьЭлементы();
		СтрокаБлока = Неопределено;
		ИндексСтрокиДерева = 0;
		Пока ИндексСтрокиДерева < СтрокиДерева.Количество() Цикл
			СтрокаДерева = СтрокиДерева[ИндексСтрокиДерева];
			Если ГруппаОбновленияКоличества <> Неопределено И СтрокаДерева.ЭтоЗаголовокБлока
				И СтрокаДерева.Группа = ГруппаОбновленияКоличества Тогда
				СтрокаБлока = СтрокаДерева;
			КонецЕсли;
			ИндексСтрокиДерева = ИндексСтрокиДерева + 1;
		КонецЦикла;
		
		Для каждого СвойстваКоличестваВБлокеКлючИЗначение Из СвойстваКоличестваВБлоках Цикл
			ГруппаСвойстваКоличества = ?(СвойстваКоличестваВБлокеКлючИЗначение.Ключ = "Все",
				Неопределено, СвойстваКоличестваВБлокеКлючИЗначение.Ключ);
			Если ГруппаОбновленияКоличества = Неопределено ИЛИ ГруппаСвойстваКоличества = ГруппаОбновленияКоличества Тогда
				СвойстваКоличестваВБлоке = СвойстваКоличестваВБлокеКлючИЗначение.Значение;
				Если СвойстваКоличестваВБлоке.ЭлементБлока <> Неопределено Тогда
					ОтображаемоеКоличествоВБлоке = ?(ВключатьПросмотренные,
						СвойстваКоличестваВБлоке.ВсехВБлоке, СвойстваКоличестваВБлоке.КоличествоВБлоке);
					ОтображаемоеКоличествоВБлокеСтрокой = Формат(ОтображаемоеКоличествоВБлоке, "ЧЦ=3; ЧН=; ЧГ=");
					СвойстваКоличестваВБлоке.ЭлементБлока.Заголовок = СтрШаблон(
						СвойстваКоличестваВБлоке.ТекстБлока,
						?(ОтображаемоеКоличествоВБлоке > 99, "99+", ОтображаемоеКоличествоВБлокеСтрокой));
					СвойстваКоличестваВБлоке.ЭлементБлока.ЦветТекста =
						?(ГруппаСвойстваКоличества = Форма.ОтборГруппа, ЦветТекстаВыделенногоБлока, Форма.ЦветГиперссылки);
					СвойстваКоличестваВБлоке.ГруппаБлока.ЦветФона =
						?(ГруппаСвойстваКоличества = Форма.ОтборГруппа, ЦветФонаВыделенногоБлока, Форма.ФонНевыделенного);
					
					// обновить количество для "Все"
					Если НЕ ВключатьПросмотренные И ГруппаОбновленияКоличества <> Неопределено Тогда
						СвойстваКоличестваВБлокеВсе = СвойстваКоличестваВБлоках["Все"];
						ОтборКоличестваВБлокахВсе = Новый Структура("Группа", "Все");
						ЭлементыКоличестваВБлокахВсе = Форма.КоличествоВБлоках.НайтиСтроки(ОтборКоличестваВБлокахВсе);
						ОтборКоличестваВБлоках = Новый Структура("Группа", ГруппаСвойстваКоличества);
						ЭлементыКоличестваВБлоках = Форма.КоличествоВБлоках.НайтиСтроки(ОтборКоличестваВБлоках);
						Если СвойстваКоличестваВБлокеВсе <> Неопределено И ЭлементыКоличестваВБлокахВсе.Количество() <> 0
							И ЭлементыКоличестваВБлоках.Количество() <> 0 Тогда
							
							КоличествоВБлокеВсе = ЭлементыКоличестваВБлокахВсе[0].КоличествоВБлоке
								- ЭлементыКоличестваВБлоках[0].КоличествоВБлоке + СвойстваКоличестваВБлоке.КоличествоВБлоке;
							КоличествоВБлокеВсеСтрокой = Формат(КоличествоВБлокеВсе, "ЧЦ=3; ЧН=; ЧГ=");
							СвойстваКоличестваВБлокеВсе.ЭлементБлока.Заголовок = СтрШаблон(
								СвойстваКоличестваВБлокеВсе.ТекстБлока,
								?(КоличествоВБлокеВсе > 99, "99+", КоличествоВБлокеВсеСтрокой));
							Если СтрокаБлока <> Неопределено Тогда
								СтрокаБлока.ЗаголовокБлока = СтрШаблон(
									СвойстваКоличестваВБлоке.ТекстБлока,
									ОтображаемоеКоличествоВБлокеСтрокой);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Форма.КоличествоВБлоках.Очистить();
		Для каждого СвойстваКоличестваВБлокеКлючИЗначение Из СвойстваКоличестваВБлоках Цикл
			ЭлементКоличестваВБлоках = Форма.КоличествоВБлоках.Добавить();
			ЭлементКоличестваВБлоках.Группа = СвойстваКоличестваВБлокеКлючИЗначение.Ключ;
			ЭлементКоличестваВБлоках.КоличествоВБлоке = СвойстваКоличестваВБлокеКлючИЗначение.Значение.КоличествоВБлоке;
		КонецЦикла;
	КонецЕсли;
	Форма.Элементы.БлокиНовогоОбщая.Видимость = Форма.НовыеСобытияПоСтраницамЖурнала;
	
	// получение сведений об общем количестве без учета отборов
	Если ЗначениеЗаполнено(Форма.ОтборОрганизацияНовое) ИЛИ ЗначениеЗаполнено(Форма.ОтборГосорганНовое)
		ИЛИ ЗначениеЗаполнено(Форма.ОтборПериодНовое) Тогда
		СведенияОКоличестве = СведенияОКоличествеНовыхБезУчетаОтборов();
	КонецЕсли;
	
	// количество для кнопки перехода в новые сообщения
	Форма.КоличествоНепрочитанных = СведенияОКоличестве.КоличествоНепрочитанных;
	
	Форма.КоличествоНовых = СведенияОКоличестве.КоличествоНовых;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СведенияОКоличествеНовыхБезУчетаОтборов()
	
	ДеревоНовыхСобытий = ЭлектронныйДокументооборотСКонтролирующимиОрганами.НовоеДеревоНовыхСобытий();
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаполнитьДеревоНовое(ДеревоНовыхСобытий);
	Возврат ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ОбновитьКоличествоНовых(ДеревоНовыхСобытий);
	
КонецФункции

&НаСервере
Функция ЗаполнитьДеревоНовое()
	
	ЕстьИзмененияВНовыхСообщениях = Ложь;
	
	ОтборыВызова = Неопределено;
	Если НовыеСобытияПоСтраницамЖурнала И Элементы.ГруппаОтборовНовое.Видимость Тогда
		ОтборыВызова = Новый Структура;
		ОтборыВызова.Вставить("Организация", ОтборОрганизацияНовое);
		ОтборыВызова.Вставить("ВидКонтролирующегоОргана", ОтборГосорганНовое);
		ОтборыВызова.Вставить("ДатаНачала", НачалоПериодаНовое);
		ОтборыВызова.Вставить("ДатаОкончания", КонецПериодаНовое);
		ОтборыВызова.Вставить("ТолькоУказанныйПериод", ТолькоУказанныйПериодНовое);
		ОтборыВызова.Вставить("Группа", ОтборГруппа);
		ОтборыВызова.Вставить("ВключатьПросмотренные", ОтборВидСообщения);
	КонецЕсли;
	Элементы.ГруппаНовоеСвернутьРазвернуть.Доступность = НЕ ЗначениеЗаполнено(ОтборГруппа);
	
	Если ЗначениеЗаполнено(АдресДереваНовых) Тогда
		ЗначениеВРеквизитФормы(ПолучитьИзВременногоХранилища(АдресДереваНовых), "Новое");
		
	Иначе
		ИнициаторСеанса = ?(ЭтоАвтообмен, Перечисления.ИнициаторыСеансовСвязиСКонтролирующимиОрганами.Автообмен,
			Неопределено);
		
		ДеревоНовое = РеквизитФормыВЗначение("Новое");
		ДеревоНовоеНепоказанные = Неопределено;
		Если НовыеСобытияПоСтраницамЖурнала Тогда
			ДеревоНовоеНепоказанные = РеквизитФормыВЗначение("НовоеНепоказанные");
		КонецЕсли;
		
		ТекущиеСобытия = Новый Соответствие;
		Для каждого СтрокаДерева Из ДеревоНовое.Строки Цикл
			Если ЗначениеЗаполнено(СтрокаДерева.Ссылка) Тогда
				ТекущиеСобытия.Вставить(Строка(СтрокаДерева.Ссылка.УникальныйИдентификатор()) + СтрокаДерева.Статус, Истина);
			КонецЕсли;
			Для Каждого ПодСтрокаДерева Из СтрокаДерева.Строки Цикл
				Если ЗначениеЗаполнено(ПодСтрокаДерева.Ссылка) Тогда
					ТекущиеСобытия.Вставить(Строка(ПодСтрокаДерева.Ссылка.УникальныйИдентификатор()) + ПодСтрокаДерева.Статус, Истина);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаполнитьДеревоНовое(
			ДеревоНовое,
			ИнициаторСеанса,,
			ОтборыВызова,
			ДеревоНовоеНепоказанные);
		
		Для каждого СтрокаДерева Из ДеревоНовое.Строки Цикл
			Если ЗначениеЗаполнено(СтрокаДерева.Ссылка) Тогда
				КлючПоиска = Строка(СтрокаДерева.Ссылка.УникальныйИдентификатор()) + СтрокаДерева.Статус;
				Если ТекущиеСобытия.Получить(КлючПоиска) = Неопределено Тогда
					ЕстьИзмененияВНовыхСообщениях = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоНовое, "Новое");
		Если НовыеСобытияПоСтраницамЖурнала Тогда
			ЗначениеВРеквизитФормы(ДеревоНовоеНепоказанные, "НовоеНепоказанные");
		КонецЕсли;
	КонецЕсли;
	
	ДатаПоследнегоОбновления = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ДатаПоследнегоОбновленияСобытий(
		ИнициаторСеанса);
	НадписьВремяОбновления = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ПолучитьНадписьВремяОбновления(
		ДатаПоследнегоОбновления);
	
	Если Не ЗначениеЗаполнено(ДатаПоследнегоОбновления) Тогда
		ДатаПоследнегоОбновления = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ДатаПоследнегоОбновления = МестноеВремя(ДатаПоследнегоОбновления);
	
	ОбновитьКоличествоНовых(ЭтотОбъект, Истина);
	
	Возврат ЕстьИзмененияВНовыхСообщениях;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНеобходимоРасшифровать(НеобходимоРасшифровать = Неопределено)
	
	КоличествоСообщенийВсегоНеобходимоРасшифровать = 0;
	Если НовыеСобытияПоСтраницамЖурнала И Элементы.ГруппаОтборовНовое.Видимость Тогда
		Если НеобходимоРасшифровать = Неопределено Тогда
			КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
			Если КонтекстЭДОСервер <> Неопределено Тогда
				НеобходимоРасшифровать = КонтекстЭДОСервер.ПолучитьСообщенияДляРасшифровки().НеобходимоРасшифровать;
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимоРасшифровать <> Неопределено Тогда
			ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
			КоличествоСообщенийТребования = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[
				Перечисления.ВидыДокументовВЖурнале.ТребованиеИлиУведомление]);
			КоличествоСообщенийОтчеты = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Отчеты]);
			КоличествоСообщенийУведомления = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Уведомления]);
			КоличествоСообщенийПисьма = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Письма]);
			КоличествоСообщенийСверки = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Сверки]);
			КоличествоСообщенийВходящие = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Входящие]);
			КоличествоСообщенийВыплатыИПособия = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.ВыплатыИПособия]);
			КоличествоСообщенийВсегоНеобходимоРасшифровать = КоличествоСообщенийТребования + КоличествоСообщенийОтчеты
				+ КоличествоСообщенийУведомления + КоличествоСообщенийСверки + КоличествоСообщенийПисьма
				+ КоличествоСообщенийВходящие + КоличествоСообщенийВыплатыИПособия;
			Элементы.НеобходимоРасшифроватьРасшифровать.Заголовок = СтрШаблон(
				НСтр("ru = 'Расшифровать (%1)'"),
				Формат(КоличествоСообщенийВсегоНеобходимоРасшифровать, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.ТребованияКоличество.Заголовок = ?(КоличествоСообщенийТребования > 99, "99+",
				Формат(КоличествоСообщенийТребования, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.ОтчетыКоличество.Заголовок = ?(КоличествоСообщенийОтчеты > 99, "99+",
				Формат(КоличествоСообщенийОтчеты, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.УведомленияКоличество.Заголовок = ?(КоличествоСообщенийУведомления > 99, "99+",
				Формат(КоличествоСообщенийУведомления, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.СверкиКоличество.Заголовок = ?(КоличествоСообщенийСверки > 99, "99+",
				Формат(КоличествоСообщенийСверки, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.ПисьмаКоличество.Заголовок = ?(КоличествоСообщенийПисьма > 99, "99+",
				Формат(КоличествоСообщенийПисьма, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.ВходящиеКоличество.Заголовок = ?(КоличествоСообщенийВходящие > 99, "99+",
				Формат(КоличествоСообщенийВходящие, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.ВыплатыИПособияКоличество.Заголовок = ?(КоличествоСообщенийВыплатыИПособия > 99, "99+",
				Формат(КоличествоСообщенийВыплатыИПособия, "ЧЦ=3; ЧН=; ЧГ="));
		КонецЕсли;
	КонецЕсли;
	
	Элементы.НеобходимоРасшифроватьОбщая.Видимость = ПоказыватьНеобходимоРасшифровать
		И КоличествоСообщенийВсегоНеобходимоРасшифровать <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНеобходимоРасшифроватьВФоне()
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗаполнитьНеобходимоРасшифровать", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьНеобходимоРасшифровать() Экспорт
	
	ОтключитьОбработчикОжидания("Подключаемый_ЗаполнитьНеобходимоРасшифровать");
	
	ПараметрыОперации = Новый Структура("ИмяОповещения", "ЗаполнитьНеобходимоРасшифровать");
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОжидатьОкончанияФоновогоЗаданияРезультат",
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент,
		ПараметрыОперации);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ВыводитьСообщения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительнаяОперация = ЗаполнитьНеобходимоРасшифроватьПараметры();
	Если ДлительнаяОперация = Неопределено
		ИЛИ (ДлительнаяОперация.Статус <> "Выполняется"
			И ДлительнаяОперация.Статус <> "Выполнено") Тогда
		Возврат;
	КонецЕсли;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНеобходимоРасшифроватьПараметры()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнить количество требующих расшифровки сообщений'");
	ПараметрыВыполнения.ОжидатьЗавершение = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаполнитьНеобходимоРасшифроватьВФоне");
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_НовоеРазворачивание() Экспорт
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект, "ПропуститьВсеГруппы");
	ДатаРазворачиванияВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
КонецПроцедуры

&НаКлиенте
Функция ПереопределитьОткрытие(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Ссылка = ТекущиеДанные.Ссылка;
	
		Переопределить = Ложь;
		
		Попытка
			МодульСверкаСФНС = ОбщегоНазначенияКлиент.ОбщийМодуль("СверкаСФНСКлиент");
		Исключение
		    МодульСверкаСФНС = Неопределено;
		КонецПопытки; 
		
		Если МодульСверкаСФНС <> Неопределено Тогда
			СтандартнаяОбработка = Истина;
			МодульСверкаСФНС.ФормаНовыхСобытий_ТаблицаНовоеПриОткрытии(ЭтотОбъект, Ссылка, СтандартнаяОбработка);
			
			Если НЕ СтандартнаяОбработка Тогда
				Переопределить = Истина;
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Переопределить;

КонецФункции

#КонецОбласти
